Revit 2027 API
IExternalDataManagerServer.IsCommandEnabled Method
 Checks if the command is enabled.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool IsCommandEnabled(
	Document document,
	ExternalDataManagerCommandId commandId,
	IList<ExternalDataManagerDataItemId> dataIds
)
Function IsCommandEnabled (
	document As Document,
	commandId As ExternalDataManagerCommandId,
	dataIds As IList(Of ExternalDataManagerDataItemId)
) As Boolean
bool IsCommandEnabled(
	Document^ document,
	ExternalDataManagerCommandId^ commandId,
	IList<ExternalDataManagerDataItemId^>^ dataIds
)
abstract IsCommandEnabled :
        document : Document *
        commandId : ExternalDataManagerCommandId *
        dataIds : IList<ExternalDataManagerDataItemId> -> bool
Parameters
document Document
 The document.
commandId ExternalDataManagerCommandId
 The command name.
dataIds IList<ExternalDataManagerDataItemId>
 The selected data ids.
Return Value
Boolean
 Whether the command is enabled or not.
Remarks
 Revit calls this whenever the selection changes to grey-out commands that are not currently applicable. The method should be FAST; avoid any heavy processing or disk I/O.
See Also
Reference
IExternalDataManagerServer Interface
Autodesk.Revit.UI Namespace